Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh1-6-v3.tmx
Source language: bo
Languages: en

source: སྲིང་མོ་ཁྱོད་ཀྱིས་ཉེ་དུ་རྣམས་ཀྱི་ཆེད་དུ་དགེ་སྦྱོང་གཽ་ཏ་མ་ལ་ཁོ་མོ་དང་ལྷན་ཅིག་ཏུ་མི་ཚངས་པར་སྤྱད་དོ་ཞེས་ཁྱོད་སྐུར་པ་འདེབས་པར་སྤྲོ་འམ་དེ་ལྟ་ན་བདག་ཅག་གི་རྙེད་པ་དང་བཀུར་སྟི་སྔོན་གྱི་བཞིན་དུ་འགྱུར་རོ།
en: “Sister, can you slander the śramaṇa Gautama for the sake of your relatives, saying, ‘He had sexual intercourse with me’? If you do this, our gain and honor will be restored.”

source: །དེ་སྐད་ཅེས་སྨྲས་པ་དང་། བྲམ་ཟེའི་བུ་མོ་ཀུན་དུ་རྒྱུ་རྩྭ་མིས་གཞན་མུ་སྟེགས་ཅན་དང་། ཀུན་དུ་རྒྱུ་རབ་ཏུ་མང་པོ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ།
en: Having heard this proposal, the brahmin girl Cañcā answered the many wandering mendicants belonging to a different faith:

source: །འཕགས་པ་དག་དགེ་སྦྱོང་གཽ་ཏ་མ་ལ་ནི་སྐུར་པ་འདེབས་པར་བདག་མི་སྤྲོའོ།
en: “Noble ones, I would not like to slander the śramaṇa Gautama.”

source: །སྲིང་མོ་ཁྱོད་ཇི་ཙམ་དུ་དགེ་སློང་གཽ་ཏ་མ་ལ་སྐུར་པ་འདེབས་པར་མི་སྤྲོ་བ་དེ་ཙམ་དུ་བདག་ཅག་དང་གཏམ་འདྲེ་བར་མི་བྱ། ཕེབས་པར་སྨྲ་བར་མི་བྱ། བལྟ་བར་མི་བྱ།
en: “Sister, unless you slander the śramaṇa Gautama, you may not have any conversation with us, speak in a friendly manner with us, meet us, or see us.

source: རྣམ་པར་བལྟ་བར་མི་བྱ་ཞིང་ཁྱོད་གནས་ཐམས་ཅད་དུ་འདུག་ཏུ་མི་གཞུག་སྟེ།
en: We will not let you stay anywhere.

source: འགྱོད་པ་དེ་ཉིད་ཀྱིས་དུས་བྱས་ནས་སེམས་ཅན་དམྱལ་བ་རྣམས་སུ་སྐྱེ་བར་འགྱུར་བ་གང་ཡིན་པའི་གནས་དེ་ཡོད་དོ།
en: It is possible that you will die from grief over this and be reborn in various hells.” (Women have little wisdom.)

source: །བུད་མེད་ནི་ཤེས་རབ་ཆུང་བ་ཡིན་པས་དེ་སྐྲག་ནས་སྨྲས་པ། འཕགས་པ་བདག་གིས་ཇི་ལྟ་བུ་ཞིག་བགྱི།
en: Thus she became afraid and said, “Noble ones, I will do so.”

source: སྲིང་མོ་ཚུར་ཁྱོད་རྒྱལ་བུ་རྒྱལ་བྱེད་ཀྱི་ཚལ་དུ་རྒྱུན་དུ་སོང་ལ་དུས་ཐ་གི་ཙམ་ལོན་ནས་དགེ་སྦྱོང་གཽ་ཏ་མ་ལ་སྐུར་པ་ཐོབ་ཤིག །དེ་ཉི་མ་རེ་རེ་ཞིང་ལངས་ཏེ་རྒྱལ་བུ་རྒྱལ་བྱེད་ཀྱི་ཚལ་དུ་སོང་ངོ་།
en: “Sister, for now pay frequent visits to the Jetavana, and then slander the śramaṇa Gautama sometime later.” She visited the Jetavana after waking up every morning.

source: །ཇི་ཙམ་ན་ལྟོ་ལ་སྣོད་ཅིག་བཅིངས་ནས་བཅོམ་ལྡན་འདས་གང་ན་བ་དེར་སོང་ངོ་།
en: Later, she tied a vessel to her belly and went to the Blessed One.

source: །དེའི་ཚེ་བཅོམ་ལྡན་འདས་འཁོར་བརྒྱ་ཕྲག་དུ་མའི་གུང་ལ་ཆོས་འཆད་ཅིང་བཞུགས་སོ།
en: At that time, the Blessed One was preaching the Dharma in front of an audience of hundreds.

source: །བཅོམ་ལྡན་འདས་ཀྱིས་བྲམ་ཟེའི་བུ་མོ་ཀུན་དུ་རྒྱུ་རྩྭ་མི་རྒྱང་རིང་པོ་ཁོ་ན་ནས་གཟིགས་སོ། །གཟིགས་ནས་ཀྱང་འདི་སྙམ་དུ་དགོངས་ཏེ། ང་ཉིད་ཀྱིས་ལས་རྣམས་བྱས་ཤིང་བསགས་པ། ཚོགས་རྙེད་པ། རྐྱེན་ཡོངས་སུ་བསྒྱུར་བ།
en: When the Blessed One saw the brahmin girl, the female mendicant Cañcā, from a distance, he thought, “The actions were performed and accumulated by me, accruing a heap of karma.

source: འོད་པ་བཞིན་ཏུ་ཉེ་བར་གནས་པ།
en: The conditions have ripened, and they approach me like a flood, inevitably.

source: གདོན་མི་ཟ་བར་འབྱུང་བར་འགྱུར་བ་རྣམས་གཞན་སུ་ཞིག་གིས་སོ་སོར་མྱོང་བར་འགྱུར་སྙམ་མོ།
en: Who else but me would experience the actions that will certainly appear?”

source: །དེ་ནས་བྲམ་ཟེའི་བུ་མོ་ཀུན་ཏུ་རྒྱུ་རྩྭ་མི་བཅོམ་ལྡན་འདས་ཀྱི་སྤྱན་སྔར་འདུག་ནས་གསོལ་པ།
en: Thereupon the brahmin girl, the female mendicant Cañcā, sat down in front of the Blessed One and said:

source: བདག་ནི་འདི་རུ་སྦྲུམ་བགྱིས་ནས།
en: “Having made me pregnant here,

source: །ཆགས་པར་འགྱུར་ཞིང་དགའ་འགྱུར་བ། །སྙན་ཅིང་འཇེབས་པའི་གསུང་དབྱངས་ཀྱིས།
en: Having been attached and enjoyed yourself,

source: །ད་ལྟ་ཆོས་ནི་གསུང་མཛད་དམ།
en: Are you now preaching the Dharma With sweet, articulate words?”

source: ཡང་དག་མིན་པ་སྨྲ་བ་དམྱལ་བར་འགྲོ།
en: “One who tells a lie goes to hell.”

source: །བྲམ་ཟེའི་བུ་མོ་རྩྭ་མིས་གསོལ་པ།
en: The brahmin girl Cañcā replied,

source: གང་གིས་བྱས་ནས་མ་བྱས་ཞེས་སྨྲའམ།
en: “So does one who claims ‘I did not’ after he did.”

source: དམན་པའི་ཆོས་ཅན་མི་ནི་དེ་གཉི་ག །ཕ་རོལ་དག་ཏུ་འདྲ་བར་འགྲོ་བར་འགྱུར།
en: “Both of them, who are naturally inferior, Will go to the next life in the same way.”

source: །དེ་ནས་ལྷ་རྣམས་ཀྱི་དབང་པོ་བརྒྱ་བྱིན་འདི་སྙམ་དུ་སེམས་ཏེ། ཀྱེ་མ་བྲམ་ཟེའི་བུ་མོ་རྩྭ་མི་འདི་ནི་བཅོམ་ལྡན་འདས་དང་དགེ་སློང་གི་དགེ་འདུན་ལ་ཡུན་རིང་མོ་ནས་མཐོ་འཚམ་པར་བྱེད་དོ་སྙམ་དུ་བསམས་ནས་རྫུ་འཕྲུལ་གྱིས་སྣོད་དེ་ས་ལ་ལྷུང་བར་བྱས་སོ།
en: Thereupon Śakra, Lord of the Gods, thought, “Alas, this brahmin girl Cañcā has been planning to harm the Blessed One and the community of monks for a long time!” He caused the vessel to fall on the ground through his magical power.

source: །དེ་ནས་བྲམ་ཟེའི་བུ་མོ་རྩྭ་མི་སྐྱེངས་ནས་རིངས་པ་རིངས་པར་སླར་སོང་ངོ་།
en: Then the brahmin girl Cañcā was ashamed and quickly went away. XI. Anavatapta A. The Buddha’s Visit to Lake Anavatapta

source: །དེ་ནས་དགེ་སློང་གནས་བརྟན་གནས་བརྟན་རྣམས་ཀྱིས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཙུན་པ་ཀོ་ས་ལའི་རྒྱལ་པོ་གསལ་རྒྱལ་ལ་ཆོས་ཀྱི་དབང་དུ་བགྱི་བའི་བཀའ་མཆིད་ཀྱང་བཀའ་སྩལ།
en: Thereupon the monks who were the most venerable of the elders said to the Blessed One, “Honored One, the discourse concerned with the Dharma was given to King Prasenajit of Kosala.

source: གང་དུ་ཐོག་མར་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཐུགས་བསྐྱེད་པ་ཡང་ལུང་བསྟན། ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཇི་སྙེད་ཅིག་ལ་བསྙེན་བཀུར་བགྱིས་པ་ཡང་བཀའ་སྩལ་ལགས་པས་ཅི་ནས་བདག་ཅག་མཚོ་ཆེན་པོ་མ་དྲོས་པར་མཆིས་ལ། བཅོམ་ལྡན་འདས་ཀྱི་སྤྱན་སྔར་རང་རང་གི་ལས་ཀྱི་རྒྱུ་བ་ལུང་བསྟན་པར་བགྱིའོ།
en: Where you formed the resolve toward supreme and complete awakening for the first time and how many completely awakened ones the Blessed One served were also explained. Thus, we will go to the great lake Anavatapta and, in the presence of the Blessed One, explain the karmic bond of each of us.”

source: །བཅོམ་ལྡན་འདས་ཀྱིས་དགེ་སློང་གནས་བརྟན་གནས་བརྟན་རྣམས་ལ་ཅང་མི་གསུང་བས་གནང་ངོ་།
en: The Blessed One assented to the monks who were the most venerable of the elders by remaining silent.

source: །ཆོས་ཉིད་ཀྱིས་སངས་རྒྱས་བཅོམ་ལྡན་འདས་འཚོ་ཞིང་གཞེས་པ་རྣམས་ཀྱི་གདོན་མི་ཟ་བར་མཛད་པ་ནི་བཅུ་སྟེ། བཅུ་གང་ཞེ་ན།
en: It is natural that the buddhas, the blessed ones, without fail perform ten acts while alive. What are the ten? (1) To predict a future buddha; (2) to cause some beings to make the resolution to attain complete and supreme awakening without regressing; (3) to convert all those who are to be converted by that buddha; (4) to indicate the best two of their disciples; (5) to establish the boundary of the community; (6)

source: ཇི་སྲིད་སངས་རྒྱས་སུ་ལུང་བསྟན་པ་དང་། སེམས་ཅན་འགས་ཀྱང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཕྱིར་མི་ལྡོག་པའི་སེམས་བསྐྱེད་པ་དང་། སངས་རྒྱས་ཀྱིས་གདུལ་བར་བྱ་བ་ཐམས་ཅད་བཏུལ་བ་དང་། ཉན་ཐོས་ཀྱི་མཆོག་ཟུང་གཅིག་ཏུ་བསྟན་པ་དང་། མཚམས་བཅད་པ་དང་། སྐུ་ཚེའི་ལྔ་ཆ་བཏང་བ་དང་། མཉན་ཡོད་དུ་ཆོ་འཕྲུལ་ཆེན་པོ་རྣམ་པར་བསྟན་པ་དང་། གྲོང་ཁྱེར་གསལ་བར་ལྷ་ལས་གཤེགས་པ་བསྟན་པ་དང་ཡབ་དང་ཡུམ་གཉིས་བདེན་པ་དག་ལ་བཀོད་པ་དང་། མཚོ་ཆེན་པོ་མ་དྲོས་པར་ཉན་ཐོས་ཀྱི་དགེ་འདུན་དང་ཐབས་ཅིག་ཏུ་སྔོན་གྱི་ལས་ཀྱི་རྒྱུ་བ་བསྟན་པ་མ་མཛད་པ་དེ་སྲིད་དུ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཡོངས་སུ་མྱ་ངན་ལས་མི་འདའོ།
en: to abandon one fifth of their life; (7) to display a great miracle in Śrāvastī; (8) to show themselves descending from among the gods in the city of Sāṃkāśya; (9) to establish their parents in the truths; (10) and to show the former karmic bonds together with the community of disciples on the great lake Anavatapta. The buddhas, the blessed ones, do not become completely emancipated until they have performed these acts.

source: །དོན་འདི་ལ་ནི་བཅོམ་ལྡན་འདས་ཉན་ཐོས་ཀྱི་དགེ་འདུན་དང་ཐབས་ཅིག་མཚོ་ཆེན་པོ་མ་དྲོས་པར་སྔོན་གྱི་ལས་ཀྱི་རྒྱུ་བ་ལུང་བསྟན་པར་བཞེད་ནས་དགེ་སློང་རྣམས་ལ་བཀའ་སྩལ་པ།
en: In this case, the Blessed One wished to explain the former karmic bonds together with the community of disciples on the great lake Anavatapta.

source: དགེ་སློང་དག་མཚོ་ཆེན་པོ་མ་དྲོས་པ་གང་ན་བར་འདོང་། དེར་རང་རང་གི་སྔོན་གྱི་ལས་ཀྱི་རྒྱུ་བ་ལུང་བསྟན་པར་བྱའོ།
en: He said to the monks, “Monks, let us go to the great lake Anavatapta and explain the former karmic bonds there.”

source: །བཙུན་པ་བཀའ་བཞིན་འཚལ་ཞེས་དགེ་སློང་རྣམས་ཀྱིས་བཅོམ་ལྡན་འདས་ཀྱི་ལྟར་མཉན་ཏོ།
en: “Certainly, O Honored One,” replied the monks to the Blessed One.

source: །དེ་ནས་བཅོམ་ལྡན་འདས་དགྲ་བཅོམ་པ་ལྔ་བརྒྱར་གཅིག་གིས་མ་ཚང་བ་དང་ཐབས་ཅིག་ཏུ་མཉན་ཡོད་ནས་མི་སྣང་བར་གྱུར་ཏེ་མཚོ་ཆེན་པོ་མ་དྲོས་པར་གཤེགས་སོ།
en: Thereupon the Blessed One, together with four hundred ninety-nine arhats, disappeared from Śrāvastī and went to the great lake Anavatapta.

source: །གནོད་སྦྱིན་གཏུམ་པོ་མི་བཟད་གནས་པ་ཡིད་འོང་ཞིང་།
en: The place where fierce, dreadful yakṣas dwell

source: །མེ་ཏོག་སྣ་ཚོགས་ཤིང་གིས་རྣམ་པར་མཛེས་བྱས་པ། །དེ་ལས་རྒྱ་མཚོ་དུག་ཅན་དག་ཏུ་འགྲོ་བ་ཡི།
en: Is pleasant, illuminated by various flowering trees.

source: །ཆུ་བོ་ཆེན་པོ་བཞི་པོ་འདི་དག་ཕྱོགས་བཞིར་འབབ།
en: From there, these four great rivers coursing toward the oceans Flow down in the four directions: The Ganges, Indus, Vakṣu, And Sītā. There

source: །གང་གཱ་སིན་དྷུ་དེ་བཞིན་པ་ཀྵུ་དང་། །སི་ཏ་དེ་ལ་རྫུ་འཕྲུལ་སྟོབས་ཐོབ་པ། །མ་གཏོགས་མི་རྣམས་ཀྱིས་ནི་མི་བགྲོད་པ།
en: People do not go, except those who have attained magical power.

source: །དེར་ནི་ཐུབ་པ་དགེ་འདུན་བཅས་པར་བཞུགས།
en: The Muni stayed there together with the community.

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་འཇིག་རྟེན་པའི་ཐུགས་བསྐྱེད་པ་མཛད་དེ།
en: Thereupon the Blessed One entertained mundane thoughts.

source: ཆོས་ཉིད་ཀྱིས་གང་གི་ཚེ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱིས་འཇིག་རྟེན་པའི་ཐུགས་བསྐྱེད་པ་མཛད་པ་དེའི་ཚེ་སྲོག་ཆགས་གྲོག་སྦུར་ཡན་ཆད་ཀྱི་སེམས་ཀྱིས་བཅོམ་ལྡན་འདས་ཀྱི་དགོངས་པ་ཤེས་པར་འགྱུར་བས།
en: It naturally occurs that when the buddhas, the blessed ones, entertain mundane thoughts, living creatures, including those as small as ants, understand the Blessed One’s thoughts.

source: དེ་ནས་ཀླུའི་རྒྱལ་པོ་དགའ་བོ་དང་ཉེ་དགའ་བོ་གཉིས་ཀྱིས་བསམས་པ། ཅིའི་ཕྱིར་བཅོམ་ལྡན་འདས་ཀྱིས་འཇིག་རྟེན་པའི་ཐུགས་བསྐྱེད་པ་མཛད་སྙམ་ན། མཚོ་ཆེན་པོ་མ་དྲོས་པར་ལས་ཀྱི་རྒྱུ་བ་ལུང་བསྟན་པར་བཞེད་པར་མཐོང་ངོ་།
en: The nāga kings Nanda and Upananda therefore wondered, “Why did the Blessed One entertain mundane thoughts?” They then saw that the Blessed One intended to explain the former karmic bonds on the great lake Anavatapta.

source: །དེ་ནས་དེ་གཉིས་ཀྱིས་མཚོ་ཆེན་པོ་མ་དྲོས་པའི་ནང་དུ་པད་མ་འདབ་མ་སྟོང་དང་ལྡན་པ་ཤིང་རྟའི་འཕང་ལོ་ཙམ་བཟང་པོ་ཐམས་ཅད་གསེར་ལས་བྱས་པ། སྡོང་པོ་ནི་རིན་པོ་ཆེ། གེ་སར་ནི་རྡོ་རྗེ་ལས་བྱས་པ།
en: And so, in the middle of the great lake Anavatapta they created a lotus blossom with a thousand petals, which was as large as the wheel of a chariot, beautiful, and made entirely of gold, and whose stalk was made of jewels, whose filaments were made of diamonds, and which was surrounded by thousands of other lotus blossoms.

source: པད་མ་སྟོང་ཕྲག་དུ་མས་ཡོངས་སུ་བསྐོར་བ་ཞིག་སྤྲུལ་པ་དང་། བཅོམ་ལྡན་འདས་དགེ་སློང་གི་དགེ་འདུན་གྱི་གུང་ལ་པད་མའི་སྙིང་པོ་དེ་ལ་བཞུགས་སོ།
en: The Blessed One sat in the center of the lotus blossom before the community of monks.

source: །དགེ་སློང་གནས་བརྟན་གནས་བརྟན་རྣམས་ཀྱང་པད་མ་གཞན་རྣམས་ཀྱི་སྙིང་པོ་ལ་འཁོད་དོ།
en: The monks who were the most venerable of the elders also sat in the centers of the other lotus blossoms. B.

source: །དེའི་ཚེ་ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུ་བྱ་རྒོད་ཀྱི་ཕུང་པོའི་རི་ལ་སྣམ་སྦྱར་འདྲུབ་བོ།
en: The Contest of Magical Power between Śāriputra and Mahā­maudgalyāyana 1. A Story of the Present At that time, the venerable Śāriputra was sewing his outer robe on Mount Gṛdhrakūṭa.

source: མཽད་གལ་གྱི་བུ་སོད་ལ་རབ་ཏུ་བྱུང་བའི་ཟླ་བོ་ཁྲིད་དེ་ཤོག་ཤིག །བཙུན་པ་བཀའ་བཞིན་འཚལ་ཞེས་ཚེ་དང་ལྡན་པ་མཽད་གལ་གྱི་བུ་ཆེན་པོ་མཚོ་ཆེན་པོ་མ་དྲོས་པ་ནས་མི་སྣང་བར་གྱུར་ཅིང་བྱ་རྒོད་ཀྱི་ཕུང་པོའི་རི་ལ་ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུའི་མདུན་དུ་འདུག་སྟེ་འདི་སྐད་ཅེས་སྨྲས་སོ།
en: “Certainly, O Honored One.” The venerable Mahā­maudgalyāyana then disappeared from the great lake Anavatapta and instantly stood in front of the venerable Śāriputra on Gṛdhrakūṭa.

source: །ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུ་སྟོན་པ་དགྲ་བཅོམ་པ་ལྔ་བརྒྱར་གཅིག་གིས་མ་ཚང་བ་དང་ཐབས་ཅིག་ཏུ་མཚོ་ཆེན་པོ་མ་དྲོས་པ་ན་སྔོན་གྱི་ལས་ཀྱི་རྒྱུ་བ་ལུང་བསྟན་པར་བཞེད་ནས་ཁྱོད་ལ་གཞེས་ཀྱིས་ཚུར་ཤོག་འདོང་།
en: He said, “O Venerable Śāriputra, the Teacher is waiting for you, intending to explain the former karmic bonds together with four hundred ninety-nine arhats on The great lake Anavatapta.

source: ཚེ་དང་ལྡན་པ་མཽད་གལ་གྱི་བུ་ཆེན་པོ་རེ་ཞིག་སྣམ་སྦྱར་དྲུབས་ལ་དེ་ནས་ཕྱིས་འགྲོའོ།
en: “O Venerable Mahā­maudgalyāyana,” replied Śāriputra, “for the time being, I will sew my outer robe.

source: །དེས་སྨྲས་པ། གྲོགས་བྱའོ།
en: After that, I will go.” “I will help you,” said Mahā­maudgalyāyana.

source: །དེ་བཞིན་དུ་གྱིས་ཤིག །དེ་ནས་ཚེ་དང་ལྡན་པ་མཽད་གལ་གྱི་བུ་ཆེན་པོས་རྫུ་འཕྲུལ་གྱིས་སོར་མོ་ལྔ་ཆར་གྱིས་དྲུབ་པར་བརྩམས་པ་དང་། ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུས་སྨྲས་པ།
en: “Please do so.” Then the venerable Mahā­maudgalyāyana began to sew, using the five fingers of each hand with his magical power. The venerable Śāriputra said, “O Venerable Mahā­maudgalyāyana, now then, let’s finish sewing.”

source: ཚེ་དང་ལྡན་པ་མཽད་གལ་གྱི་བུ་ཆེན་པོ་འོ་ན་ལྟ་དྲུབ་ཟིན་དུ་ཟད་མོད། དེས་སྨྲས་པ། ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུ་གལ་ཏེ་ཁྱོད་མི་འགྲོ་ན་མཐུས་བཀུར་བར་བྱའོ།
en: “O Venerable Śāriputra,” replied Mahā­maudgalyāyana, “if you do not go on your own, I will take you by force.”

source: །དེ་ནས་ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུས་སྐེ་རགས་རྒྱ་ཅང་ཕྲོལ་ནས་སྨྲས་པ། ཚེ་དང་ལྡན་པ་མཽད་གལ་གྱི་བུ་ཆེན་པོ་ཁྱོད་བཅོམ་ལྡན་འདས་ཀྱིས་རྫུ་འཕྲུལ་གྱི་མཐུ་ཅན་རྣམས་ཀྱི་མཆོག་ཏུ་བསྟན་པ་ཡིན་ན།
en: The venerable Śāriputra then took off his belt and said, “O Venerable Mahā­maudgalyāyana, since you have been praised by the Blessed One as the best of those who possess magical power, you should take this first and take me afterward.”

source: རེ་ཞིག་ཁྱོད་ཀྱིས་འདི་ཁྱེར་ལ་དེ་ནས་ཕྱིས་ཁོ་བོ་ཁྱེར་ཅིག །དེ་ནས་ཚེ་དང་ལྡན་པ་མཽད་གལ་གྱི་བུ་ཆེན་པོས་དེ་དྲངས་པ་དང་། ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུས་བསམས་པ།
en: Then the venerable Mahā­maudgalyāyana pulled it.

source: འདི་ནི་མཐུ་ཆེ་ཞིང་རྫུ་འཕྲུལ་ཆེ་བ་ཡིན་པས་གལ་ཏེ་འདི་ཁྱེར་བར་འགྱུར་བའི་གནས་འདི་ཡོད་དོ་སྙམ་ནས་དེས་དེ་བྱ་རྒོད་ཀྱི་ཕུང་པོའི་རིའི་སྤྱིལ་བཏགས་སོ།
en: The venerable Śāriputra thought, “Since he possesses great dignity and great magical power, it is possible that he will take it.” He then tied it around the summit of Mount Gṛdhrakūṭa.

source: །ཚེ་དང་ལྡན་པ་མཽད་གལ་གྱི་བུ་ཆེན་པོས་དེ་དྲངས་པ་དང་། བྱ་རྒོད་ཀྱི་ཕུང་པོའི་རི་འགུལ་བར་གྱུར་ཏོ།
en: When the venerable Mahā­maudgalyāyana pulled it again, Mount Gṛdhrakūṭa quaked.

source: །ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུས་བསམས་པ། འདིས་བྱ་རྒོད་ཀྱི་ཕུང་པོའི་རི་ཡང་ཁྱེར་བར་འགྱུར་གྱིས།
en: The venerable Śāriputra thought, “He might take even Mount Gṛdhrakūṭa.

source: མ་ལ་བདག་གིས་རིའི་རྒྱལ་པོ་རི་རབ་ལ་གདགས་སོ་སྙམ་ནས།
en: I will now tie it around Mount Sumeru, the king of mountains.” He then did tie it around Mount Sumeru, the king of mountains.

source: དེས་དེ་རིའི་རྒྱལ་པོ་རི་རབ་ལ་བཏགས་པ་ལས། ཡང་ཚེ་དང་ལྡན་པ་མཽད་གལ་གྱི་བུ་ཆེན་པོས་དེ་དྲངས་པ་དང་། རིའི་རྒྱལ་པོ་རི་རབ་དང་། ཀླུའི་རྒྱལ་པོ་དགའ་བོ་དང་ཉེ་དགའ་བོ་དག་ཀྱང་གཡོས་པར་གྱུར།
en: Again, when the venerable Mahā­maudgalyāyana pulled it, Mount Sumeru, the king of mountains, quaked, as did the nāga kings Nanda and Upananda.

source: མ་དྲོས་པ་ཡང་ཀུན་ནས་འཁྲུགས་ཤིང་དགེ་སློང་གནས་བརྟན་གནས་བརྟན་རྣམས་ཀྱང་ལྡེག་པར་གྱུར་ནས་པད་མའི་སྙིང་པོ་ལ་འདུག་བཞིན་དུ་དེ་རྣམས་ཀྱིས་བཅོམ་ལྡན་འདས་ལ་ཞུས་པ།
en: The entire Anavatapta also trembled, and the monks who were the most venerable of the elders shook, too.

source: བཙུན་པ་ཅིའི་སླད་དུ་ཀླུའི་རྒྱལ་པོ་དགའ་བོ་དང་ཉེ་དགའ་བོ་གཉིས་གཡོས་ལགས།
en: Sitting in the centers of the lotus blossoms, they asked the Blessed One, “O Honored One, why are the two nāga kings Nanda and Upananda quaking?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། དགེ་སློང་དག་དགའ་བོ་དང་ཉེ་དགའ་བོ་གཉིས་གཡོས་པ་མ་ཡིན་ཏེ། འོན་ཀྱང་ཉན་ཐོས་ཆེན་པོ་གཉིས་རྫུ་འཕྲུལ་གྱིས་རྣམ་པར་འཕྲུལ་པར་བྱེད་དོ།
en: “Monks,” the Blessed One replied, “Nanda and Upananda are not quaking by themselves, but because the two great disciples are displaying their magical power.”

source: །ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུས་བསམས་པ། རིའི་རྒྱལ་པོ་རི་རབ་འདི་ཡང་ཁྱེར་བར་འགྱུར་གྱིས། མ་ལ་བདག་གིས་བཅོམ་ལྡན་འདས་ཀྱི་པད་མའི་སྡོང་པོ་ལ་གདགས་སོ་སྙམ་ནས། །དེས་བཅོམ་ལྡན་འདས་ཀྱི་པད་མའི་སྡོང་པོ་ལ་བཏགས་པས་མ་འགུལ་བར་འདུག་གོ།
en: The venerable Śāriputra thought, “Since even this Mount Sumeru, the king of mountains, might be taken, I will now tie the belt around the stalk of the lotus on which the Blessed One is sitting.” He then did tie it around the stalk of the lotus on which the Blessed One was sitting, and it remained unmoving.

source: །གང་གི་ཚེ་དེའི་རྫུ་འཕྲུལ་ལ་རྫུ་འཕྲུལ་གྱིས་རྡུགས་པ་དེའི་ཚེ་ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུ་ཁྱོད་ཀྱིས་རྫུ་འཕྲུལ་གྱིས་རྣམ་པར་རྩེ་བ་བྱས་ཟིན་གྱིས་ཚུར་ཤོག་འདོང་།
en: When his magical power was hindered thus by the other’s magical power, Mahā­maudgalyāyana said to the venerable Śāriputra, “O Venerable Śāriputra, you have finished playing with your magical power. Now, please come.”

source: ཚེ་དང་ལྡན་པ་མཽད་གལ་གྱི་བུ་ཆེན་པོ་སོང་ཤིག་དང་ཁོ་བོ་འོང་ངོ་ཞེས་བྱས་ནས་ཇི་སྲིད་ཚེ་དང་ལྡན་པ་མཽད་གལ་གྱི་བུ་ཆེན་པོ་མ་ཕྱིན་པ་དེའི་བར་དུ་ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུ་སྔར་ཕྱིན་ནས་བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་གཉིས་ལ་མགོ་བོས་ཕྱག་བྱས་ཏེ་པད་མའི་སྙིང་པོ་ལ་འདུག་པ་དང་། དེའི་འོག་ཏུ་ཚེ་དང་ལྡན་པ་མཽད་གལ་གྱི་བུ་ཆེན་པོ་ཕྱིན་པས་ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུ་མཐོང་ནས་དེས་སྨྲས་པ།
en: “O Venerable Mahā­maudgalyāyana, you go and I will come after.” Yet, before the venerable Mahā­maudgalyāyana arrived, the venerable Śāriputra himself arrived. He bowed low until his forehead touched the Blessed One’s feet, and then he sat in the center of a lotus blossom. Then the venerable Mahā­maudgalyāyana arrived.

source: ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུ་འོངས་སམ།
en: When he saw the venerable Śāriputra, he said, “O Venerable Śāriputra, have you already come?”

source: ཚེ་དང་ལྡན་པ་ཁོ་བོ་འོངས་སོ།
en: “Yes, I have, O Venerable One.” 2. A Story of the Past: The Painter and the Mechanic

source: །དགེ་སློང་རྣམས་ཐེ་ཚོམ་སྐྱེས་ནས་ཐེ་ཚོམ་ཐམས་ཅད་གཅོད་པ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་ལ་ཞུས་པ། བཙུན་པ་བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་མཽད་གལ་གྱི་བུ་ཆེན་པོ་ནི་རྫུ་འཕྲུལ་དང་ལྡན་པ་རྣམས་ཀྱི་མཆོག་ཏུ་བསྟན་པ་ལགས་ན། འོན་ཀྱང་ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུའི་རྫུ་འཕྲུལ་གྱིས་ཕམ་པར་བགྱིས་པ་ལ་གཟིགས།
en: The monks, feeling doubtful, inquired of the Buddha, the Blessed One, the one who severs all doubts, “How is it, O Honored One, that, although the Blessed One has praised the venerable Mahā­maudgalyāyana as the best of those who possess magical power, the venerable Śāriputra defeated him with his magical power?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། དགེ་སློང་དག་ད་ལྟ་འབའ་ཞིག་ཏུ་མ་ཟད་ཀྱི། ཇི་ལྟར་འདིས་འདས་པའི་དུས་ན་ཡང་བཟོས་ཕམ་པར་བྱས་པ་དེ་ཉོན་ཅིག །དགེ་སློང་དག་སྔོན་བྱུང་བ་ཡུལ་དབུས་སུ་རི་མོ་མཁན་གྱི་སློབ་དཔོན་ཞིག་བྱུང་ངོ་།
en: “Listen, monks,” the Blessed One replied, “how, not only in the present but also in the past, he defeated him with his art. “Monks, once there was a certain painter in the midland region.

source: །དེ་དགོས་པ་འགའ་ཞིག་གི་ཕྱིར་ཡུལ་དབུས་ནས་ཡུལ་ནས་ཅན་ཞེས་བྱ་བར་སོང་ངོ་། །དེ་དེ་ན་འཁྲུལ་འཁོར་གྱི་སྒྱུ་རྩལ་གྱི་སློབ་དཔོན་ཞིག་གི་ཁྱིམ་དུ་ཞུགས་པ་ལས།
en: He went on some business from the midland region to a region called Yavana. There he entered the house of a mechanic.

source: དེས་དེ་ངལ་བའི་རིམ་གྲོ་བར་འཁྲུལ་འཁོར་ལས་བུ་མོ་ཞིག་བྱས་ནས་བཏང་ངོ་།
en: The mechanic made a mechanical woman to attend on the fatigued painter and gave it to him.

source: །དེས་དེའི་རྐང་པ་གཉིས་བཀྲུས་ནས་འདུག་གོ།
en: It washed his feet and stayed with him.

source: །དེ་ནས་དེས་སོང་ཤིག་ཅེས་སྨྲས་ན། དེ་ཅང་མི་སྨྲ་བར་འདུག་གོ།
en: Then he said ‘Leave,’ but it remained silent.

source: །དེས་བསམས་པ། གདོན་མ་ཟོས་པར་འདི་བདག་དང་དགའ་མགུར་སྤྱད་པའི་ཕྱིར་བཏང་ངོ་སྙམ་ནས། དེས་དེའི་ལག་པ་ནས་བཟུང་སྟེ་དྲངས་པ་ལས་ཇི་ཙམ་ན་ཞིག་ནས་ཤིང་བྲུལ་གྱི་ཕུང་པོར་གྱུར་ཏོ། །དེ་སྐྱེངས་ནས་བསམས་པ།
en: He thought, ‘Certainly she must have been given to me so that she and I would enjoy ourselves.’ He took it by the hand and pulled it, whereupon it broke into a pile of wooden pieces.

source: བདག་གཅིག་པུ་ཞིག་ཏུ་སྐྱེངས་པར་བྱས་ཀྱིས།
en: He felt ashamed and thought, ‘I was humiliated here by myself.

source: མ་ལ་བདག་གིས་ནི་འདི་རྒྱལ་པོ་འཁོར་དང་བཅས་པའི་ནང་དུ་སྐྱེངས་པར་བྱའོ་སྙམ་ནས།
en: I will now humiliate him among the king and his attendants.’

source: དེས་སྒོའི་ངོས་ལོགས་ལ་རང་གི་གཟུགས་བརྙན་འགེགས་པ་ཞིག་བྲིས་ཏེ། སྒོ་ཕག་ཏུ་ཡིབ་ནས་འདུག་གོ།
en: “He then painted an image of himself hanged on the surface of the door and hid behind the door.

source: །དེ་ལྡང་བའི་དུས་གང་ཡིན་པ་དེ་ལས་ཐལ་བ་དང་། དེ་ནས་འཁྲུལ་འཁོར་གྱི་སྒྱུ་རྩལ་གྱི་སློབ་དཔོན་གྱིས་བསམས་པ།
en: When the time for him to wake up had passed, the mechanic remarked, ‘It is quite late.

source: རིང་ཞིག་ལོན་ན་ཅིའི་ཕྱིར་དེ་སྒོར་མ་བྱུང་སྙམ་དུ་བསམས་ནས་དེར་སོང་བ་ལས་ཇི་ཙམ་ན་འགེགས་ཏེ་ཤི་བ་མཐོང་ངོ་།
en: Why does he not come out the door?’ He went there and saw the man hanged and dead.

source: །དེས་བསམས་པ། ཅིའི་ཕྱིར་འདིས་བདག་ཉིད་སྲོག་དང་བྲལ་བར་བྱས་སྙམ་པ་ལས་དེས་འཁྲུལ་འཁོར་ཞིག་ནས་ཤིང་བྲུལ་གྱི་ཕུང་པོར་འདུག་པ་མཐོང་ནས་དེ་འདི་སྙམ་དུ་སེམས་ཏེ། བདག་ཉིད་སྐྱེངས་པས་འགེགས་སོ་སྙམ་མོ།
en: He wondered, ‘Why did he kill himself?’ He then saw the mechanical doll broken into a pile of wooden pieces, and thought, ‘He must have hanged himself because he felt ashamed of himself.’

source: །ཡུལ་ནས་ཅན་གྱི་ཀུན་དུ་སྤྱོད་པ་ནི་གང་སུའི་ཁྱིམ་ཡང་རུང་དེར་མི་གློ་བུར་བ་ཤི་ན་ཇི་སྲིད་རྒྱལ་པོ་ལ་མི་མཐོལ་བ་དེ་སྲིད་དུ་དེས་དེ་ལ་རིམ་གྲོ་མི་བྱེད་དོ།
en: “In the region of Yavana, when a guest died in any house, they would not hold his funeral until they had reported it to the king.

source: །དེ་ནས་དེ་རྒྱལ་པོའི་དྲུང་དུ་སོང་སྟེ་མཐོལ་བ། ལྷ་ཡུལ་དབུས་ནས་རི་མོ་མཁན་གྱི་སློབ་དཔོན་ཞིག་མཆིས་ཏེ། དེ་བདག་གི་སྡུམ་པར་གནས་པ་ལས།
en: Therefore, the mechanic went to the king and reported to him, ‘Your Majesty, a painter came from the midland region and stayed in my dwelling.

source: དེ་ལ་བཀུར་སྟི་བགྱི་བའི་སླད་དུ་བདག་གིས་འཁྲུལ་འཁོར་ལས་བུ་མོ་ཞིག་བགྱིས་ཏེ་བཏང་བ་དང་། དེས་དེ་ལག་པ་ནས་བཟུང་སྟེ་དྲངས་པས་ཤིང་གི་ཕུང་པོར་མཆིས་པ་དང་། དེ་སྐྱེངས་ནས་བདག་ཉིད་འགེགས་ལགས་ན།
en: I made a mechanical woman to attend on him and gave it to him. He took it by the hand and pulled it, whereupon it fell into a pile of wooden pieces. Ashamed, he hanged himself.

source: ལྷ་དེ་ལ་གཡར་སྔ་འབྲིམ་པ་ཞིག་གཏང་དུ་གསོལ། དེ་ནས་བདག་གིས་རིམ་གྲོ་བགྱི་ལགས་སོ།
en: Your Majesty, I request an inspection of this, and I will hold his funeral afterward.’

source: །དེ་ནས་རྒྱལ་པོས་ཞོ་ཤས་འཚོ་བ་རྣམས་ལ་བསྒོ་བ།
en: “The king then ordered his men, ‘Sirs, go and conduct the inspection.’

source: ཤེས་ལྡན་དག་དེང་ལ་གཡར་སྔ་རིམས་ཤིག །དེ་རྣམས་དོང་ནས་དེ་མཐོང་ངོ་།
en: “They went and saw the dead body.

source: །དེས་བསམས་པ། བདག་གིས་ཇི་ལྟར་ཟུང་ང་ལས་དབབ་པར་བྱ་སྙམ་མོ། །གཞན་དག་གིས་སྨྲས་པ།
en: They asked themselves, ‘In which way should we lift the body down from the hook?’ Some of them said, ‘Cut the hanging rope.’

source: འགེག་ཐག་ཆོད་སྟ་རེ་ཁྱེར་ཏེ་ཐག་པ་གཅོད་པར་བརྩམས་པ་ལས་ཇི་ཙམ་ན་རྩིག་པ་ཡིན་པར་མཐོང་ནས། དེ་ནས་འཁྲུལ་འཁོར་མཁན་གྱི་སློབ་དཔོན་དེ་སྐྱེངས་པར་གྱུར་ཏོ།
en: “When they had brought axes and began to cut the rope, they realized that it was the wall, and so the mechanic felt ashamed.

source: །དེ་དེ་ལྟར་སྐྱེངས་པར་གྱུར་པ་དང་། རི་མོ་མཁན་གྱི་སློབ་དཔོན་དེ་སྒོ་ལྐོག་ནས་ཕྱུང་སྟེ་སྨྲས་པ། ཀྱེ་ནང་རྗེ་ཁྱོད་ཀྱིས་ནི་ཁོ་བོ་གཅིག་པུ་ཞིག་ཏུ་སྐྱེངས་པར་བྱས་ཏེ། ཁྱོད་ནི་རྒྱལ་པོ་འཁོར་དང་བཅས་པའི་ནང་དུ་སྐྱེངས་པར་བྱས་སོ།
en: When he thus felt ashamed, the painter came out from behind the door and said, ‘O sir, you humiliated me here by myself, but you have now been humiliated among the king and his attendants.’

source: དེའི་ཚེ་དེའི་དུས་ཀྱི་རི་མོ་མཁན་གྱི་སློབ་དཔོན་གང་ཡིན་པ་དེ་ནི་དགེ་སློང་ཤཱ་རིའི་བུ་འདི་ཉིད་ཡིན་ཏེ། དེ་ན་ཡང་འདིས་འདི་བཟོས་ཕམ་པར་བྱས་སོ།
en: The painter at that time, on that occasion, was indeed this monk Śāriputra. The mechanic at that time, on that occasion, was indeed this monk Maudgalyāyana. At that time, he (Śāriputra) defeated him (Maudgalyāyana) with his art.

source: །ད་ལྟར་ཡང་འདིས་འདི་རྫུ་འཕྲུལ་གྱིས་ཕམ་པར་བྱས་སོ།
en: Now again, he has defeated him with his magical power.” 3. A Story of the Past: The Two Painters

source: །གཞན་ཡང་ཇི་ལྟར་འདིས་འདི་བཟོས་ཕམ་པར་བྱས་པ་དེ་ཉོན་ཅིག །དགེ་སློང་དག་སྔོན་བྱུང་བ་རི་འོར་གཞན་ཞིག་ན་རི་མོ་མཁན་གྱི་སློབ་དཔོན་གཉིས་ཤིག་བྱུང་བ་ལས་རྩོད་པར་གྱུར་ཏེ།
en: “Listen, again, to how he defeated him with his art. “Monks, once there were two painters in a certain hamlet, who fell into a quarrel with one another.

source: གཅིག་གིས་སྨྲས་པ། ང་ནི་བཟོ་ལེགས་པར་ཤེས་སོ།
en: One said, ‘I know art well.’

source: །ཅིག་ཤོས་ཀྱིས་སྨྲས་པ། ང་ནི་དེ་བས་ཀྱང་ལྷག་པར་ལེགས་པར་ཤེས་སོ།
en: “The other said, ‘I know it much better than you.’
